import React from 'react';
import './service-clause.less';


export default (props) =>
    <div id="service-clause">
        <h1>魔步户外工具平台服务协议</h1>
        <p>魔步户外是魔步户外团队的产品之一，本团队通过用户使用魔步户外的相关功能向用户提供服务，您在使用相关服务之前，需要仔细阅读《魔步户外工具平台服务协议》（以下简称“本协议”），并通过在线形式签署，您勾选【同意】，或使用网站、魔步户外俱乐部管理工具等提供的产品，即表示协议生效。</p>
        <h2>一、 服务条款的确认</h2>
        <p>感谢您选择使用魔步户外俱乐部管理工具平台（以下简称“魔步户外工具”）。本协议由您与魔步户外的经营团队共同缔结，本协议具有合同效力。在您使用魔步户外工具前，您应当阅读并遵守本协议，请您务必审慎阅读、充分理解该等协议、规则各条款内容，特别是限制或免除责任的相应条款、争议解决和法律适用条款。本协议构成法律上的书面协议，本协议限制、免责条款可能以黑体加粗形式提示您注意。除非您已阅读并接受该等协议，否则您无权使用魔步户外工具的任何部分或全部。您对魔步户外工具的任何使用行为，包括但不限于注册、登录魔步户外工具均视为您已阅读并同意受本协议全部条款的约束，届时您不应以未阅读本协议的内容或者未获得魔步户外工具对您问询的解答等理由，主张本协议无效，或要求撤销本协议。如果您不同意魔步户外工具规则的约定，您应立即停止注册或停止使用魔步户外工具服务。</p>
        <h2>二、 服务内容</h2>
        <p>1. 魔步户外工具服务的具体内容由魔步户外工具团队根据实际情况提供，魔步户外工具团队对其所提供之服务拥有最终解释权。</p>
        <p>2. 魔步户外工具服务的具体内容由魔步户外工具根据实际情况提供，魔步户外工具团队保留随时变更、升级、转型、中断或终止部分或全部服务的权利。</p>
        <h2>三、 账号及密码</h2>
        <p>1. 您一旦注册成功成为魔步户外工具用户，您将得到一个账号和密码。如果您不保管好自己的账号和密码安全，因此产生的所有损失将由您全部承担并负相应责任。此外，每个用户都要对其账户中的所有活动、事件、发布内容等负全责，因魔步户外工具团队无法对非法或未经用户授权使用的帐号的行为作出甄别，因此魔步户外不承担任何责任。</p>
        <p><b>2. 用户帐号仅代表使用者，不得转借、售卖或做非法用途。</b></p>
        <p>3. 用户应随时根据实际情况更新用户资料。用户不得使用魔步户外工具团队的帐号从事非法商业行为或发表猥亵、色情、反党反政府言论或者其他不当言论。违者将封禁部分权限直至删除帐号。</p>
        <p>4. 用户不得利用魔步户外工具的帐号、个人资料、分享、照片、群组和私信等服务进行直接或者间接非法商业宣传。</p>
        <p>5.用户若发现任何非法使用用户账号或安全漏洞的情况，请立即通告魔步户外工具团队。</p>
        <h2>四、 用户权责</h2>
        <p>1. 用户有权按照魔步户外规定的程序和要求使用魔步户外工具平台向用户提供的各项网络服务，如果用户对该服务有异议，可以与魔步户外联系以便得到及时解决。</p>
        <p>2. 用户在申请使用平台上的服务时，必须向魔步户外提供准确的个人资料，如个人资料有任何变动，请您及时更新。</p>
        <p>3. 用户在平台的网页上发布信息或者利用平台的服务时必须符合国家的法律法规有关规定。</p>
        <p>4. 对于用户通过魔步户外工具平台（包括但不限于图片、文章）上传任何内容，请遵守各地文化习俗，法律法规等。魔步户外工具团队作为网络服务提供者，对非法转载、使用行为的发生不具备充分的监控能力，请用户自行尊重他人版权，涉及到争议纠纷也与魔步户外工具团队无关，但魔步户外工具团队会在合法合规的情况下积极配合各方协调解决。</p>
        <p><b>5. 用户承诺不会在魔步户外工具平台（包括但不限于图片、文章 ）发布如下信息：</b></p>
        <p>a. 反对宪法所确定的基本原则的；</p>
        <p>b. 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
        <p>c. 损害国家荣誉和利益的；</p>
        <p>d. 煽动民族仇恨、民族歧视，破坏民族团结的；</p>
        <p>e. 破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
        <p>f. 散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
        <p>g. 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
        <p>h. 侮辱或者诽谤他人，侵害他人合法权益的；</p>
        <p>i. 含有法律、行政法规禁止的其他内容的。</p>
        <p>j. 不得利用魔步户外工具平台上载、张贴或传送任何非法、有害、胁迫、滥用、骚扰、侵害、中伤、粗俗、猥亵、诽谤、侵害他人隐私、辱骂性的、恐吓性的、庸俗淫秽的及有害或种族歧视的或道德上令人不快的包括其他任何非法的信息资料；</p>
        <p>用户单独为其发布在魔步户外工具平台上的信息承担责任。用户若在平台散布和传播违法信息，网络用户服务的系统记录有可能作为用户违法之证据。</p>
        <p>6. 用户不得利用魔步户外工具团队的服务从事以下活动：</p>
        <p>a. 故意制作、传播计算机病毒等破坏性程序；</p>
        <p>b. 未经允许，对计算机信息网络功能进行删除、修改或者增加；</p>
        <p>c. 其他危害计算机信息网络安全的行为。</p>
        <p>d. 用户不得以任何方式干扰魔步户外工具团队的服务。</p>
        <p>e. 用户承诺遵守魔步户外工具团队的所有其他规定和程序。</p>
        <p>7. 如果用户违反上述规定，魔步户外工具团队有权要求其改正或直接采取一切必要措施（包括但不限于更改或删除用户发布的信息、中断或终止用户使用网络的权利等），以减轻用户不当行为所造成的影响。</p>
        <h2>五、 魔步户外工具团队的权利及义务</h2>
        <div className="protocol_top">
            <p>1.魔步户外工具团队除特殊情况外（例如：协助公安等相关部门调查破案等），致力于努力保护用户的个人资料不被外漏，且不得在未经本人的同意下向第三者提供用户的个人资料。</p>
            <p>魔步户外工具团队根据提供服务的过程，经营上的变化，无需向用户得到同意即可更改、变更所提供服务的内容。</p>
            <p>魔步户外工具团队在提供服务过程中，应及时协商解决用户提出的不满事宜。</p>
            <p>魔步户外工具团队在下列情况下可以不通过向用户通知，直接删除其上载的内容：</p>
            <p>a. 有损于魔步户外工具团队或第三方名誉的内容；</p>
            <p>b. 利用魔步户外工具团队服务系统上载、张贴或传送任何非法、有害、胁迫、滥用、骚扰、侵害、中伤、粗俗、猥亵、诽谤、侵害他人隐私、辱骂性的、恐吓性的、庸俗淫秽的及有害或种族歧视的或道德上令人不快的包括其他任何非法的内容；</p>
            <p>c. 侵害魔步户外工具团队或第三方的版权，著作权等内容；</p>
            <p>d. 存在与魔步户外工具团队提供的服务无关的内容；</p>
            <p>e. 无故盗用他人的ID(固有用户名，姓名)上载、张贴或传送任何内容及恶意更改，伪造他人上载内容。</p>
        </div>
        <div className="protocol_top">
            <p>2.服务条款的修改</p>
            <p>魔步户外工具团队有权在必要时修改魔步户外工具团队条款，服务条款的内容一旦发生变动，魔步户外工具团队将会通过适当方式向用户提示修改内容。用户如不同意修改，可以主动选择取消用户资格；如果用户继续使用魔步户外工具团队服务，将被视为接受修改后的服务条款。</p>
        </div>
        <div className="protocol_top">
            <p>3.服务内容的修改或中断</p>
            <p>鉴于网络服务的特殊性，魔步户外工具团队保留随时修改或中断其部分或全部网络服务的权利，并无需通知用户或为此对用户及任何第三方负责。</p>
        </div>
        <div className="protocol_top">
            <p>4.用户隐私保护</p>
            <p>资料的用户或第三方(包括但不仅限于魔步户外工具团队的API应用.对用户资料的任何使用或传播行为不负责。用户的个人资料以及用户在使用网络服务时存储在魔步户外工具团队的非公开内容，但以下情况除外：</p>
            <p>a. 用户同意让第三方共享资料；</p>
            <p>b. 用户同意公开其个人资料，享受相应的产品和服务；</p>
            <p>c. 魔步户外工具团队需要依法遵循司法机关的要求或其他法律的规定；</p>
            <p>d. 按照相关政府主管部门的合理要求；</p>
            <p>e. 维护社会公共利益；</p>
            <p>f. 符合其他合法要求；</p>
            <p>g. 魔步户外工具团队发现用户违反了魔步户外工具团队服务条款或魔步户外工具团队其他使用规定。</p>
        </div>
        <div className="protocol_top">
            <p>5.中断或终止服务</p>
            <p>如发生下列任何一种情形，魔步户外工具团队有权随时中断或终止向用户提供本协议项下的网络服务，而无需对用户或任何第三方承担任何责任。</p>
            <p>5.1 用户向魔步户外工具团队提供的个人资料不真实。</p>
            <p>5.2用户违反本协议的规则或不履行其所承担的义务。</p>
            <p>除前款所述情形外，用户可随时根据需要通知魔步户外工具团队终止向该用户提供服务，用户服务终止后，用户使用服务的权利同时终止。自用户服务终止之时起，魔步户外工具团队不再对该用户承担任何责任。</p>
            <p>魔步户外工具团队同时保留在不事先通知用户的情况下随时中断或终止部分或全部魔步户外工具团队服务的权利，对于所有服务的中断或终止而造成的任何损失，魔步户外工具团队无需对用户或任何第三方承担任何责任。</p>
        </div>
        <div className="protocol_top">
            <p>6. 知识产权</p>
            <p><b>6.1 魔步户外工具团队对所有的产品、技术与所有程序及页面（包括但不限于页面设计及内容）均享有知识产权，仅供个人学习、研究和欣赏，未经授权，任何人不得擅自做商业化使用，否则，将依法追究法律责任。</b></p>
            <p><b>6.2 用户上传提交的所有资料（包括但不限于魔步户外工具团队所刊载的文本、图片、视频、Flash等）的版权归属用户，请用户自行保护好自己的版权。如若平台方需要使用，会提前获得授权。</b></p>
        </div>
        <div className="protocol_top">
            <p>7. 通告</p>
            <p>所有发给用户的通告都可以通过重要页面的公告、短信、电子邮件以及微信公众号传送。</p>
        </div>

        <div className="protocol_top">
            <p>8. 关于第三方提供的服务</p>
            <p>8.1本服务可能会提供与其他网站或资源进行链接。对于前述网站或资源是否可以利用，魔步地接不承担担保责任。因用户使用上述网站或资源所产生的损失或损害，魔步地接也不负担任何责任。</p>
            <p>8.2您在魔步地接平台上使用第三方提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的服务或用户协议。魔步地接和第三方对可能出现的纠纷在法律规定和约定的范围内各自承担责任。</p>
        </div>


        <h2>六、免责声明</h2>
        <p><b>1. 魔步户外工具团队禁止制作、复制、发布、传播等具有反动、色情、暴力、淫秽等内容的信息，一经发现，立即删除。若您因此触犯法律，我们对此不承担任何法律责任。</b></p>
        <p><b>2.用户自行上传或通过网络收集的资源，我们仅提供一个展示、交流的平台，不对其内容的准确性、真实性、正当性、合法性负责，也不承担任何法律责任。</b></p>
        <p><b>3. 任何人因使用魔步户外工具而可能遭致的意外及其造成的损失（包括因打开魔步户外工具可能链接的第三方内容而感染电脑病毒），我们对此概不负责，亦不承担任何法律责任。</b></p>
        <p><b>4. 对于因不可抗力或魔步户外工具团队不能控制的原因造成的网络服务中断或其它缺陷，魔步户外工具团队不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</b></p>
        <p><b>5. 魔步户外工具团队不对所提供之网络服务做任何类型之担保，包括但不限于：</b></p>
        <p><b>a. 网络服务一定能满足用户要求；</b></p>
        <p><b>b. 网络服务不会中断；</b></p>
        <p><b>c. 网络服务的及时性、安全性、准确性。</b></p>

        <h2>七、法律</h2>
        <p>本协议的订立、执行和解释及争议的解决均应适用中国法律。</p>
        <p>如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；自有争议之日算起超过6个月协商不成时，用户可向魔步户外工具团队经营者指定的人民法院提起诉讼。</p>


        <h2>八、其他规定</h2>
        <p>本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。</p>
        <p>如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</p>
        <p>当您使用魔步户外工具某一信息、产品、服务等具体服务时，您应遵守魔步户外团队随时公布的与该具体服务相关的具体协议、指引和规则，或者其他魔步户外团队的产品等。如《魔步地接服务协议》，《免责声明》等。</p>
        <p>本协议解释权归魔步户外工具团队，有关事项与其他声明或协议互为补充。若有冲突，以魔步户外团队公布的最新协议为准。本协议自2017年9月1日起施行。</p>
        <h3>魔步户外团队</h3>
        <h3>2017年9月1日</h3>
    </div>